{
  "backend/main.mo": "Main Motoko actor for the OnlyUs app implementing user profiles, paired-user messaging, media storage, and WebRTC call session management with access control. Exposes query and update methods for profile CRUD, message sending/reading, media upload/delete, and call signaling.",
  "feature_evidence.json": "A feature evidence report mapping implemented features (splash screen, page transitions, skeleton loading states, etc.) to their source files, component dependencies, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "A JSON document containing short human-written summaries of each frontend source file, describing the purpose and key implementation details of each component, page, hook, and utility.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes, including colors, borders, and chart variables used throughout the app.",
  "frontend/index.html": "Minimal HTML shell for the OnlyUs React SPA, setting the page title and mounting the app into a root div via the main.tsx module entry point.",
  "frontend/src/App.tsx": "Root React component managing authentication state, splash screen display, profile/pairing routing, tab navigation, and a call state machine (idle/outgoing/active voice and video) with incoming call overlays and a global error toast.",
  "frontend/src/components/BottomTabNavigator.tsx": "Fixed bottom navigation bar with four tabs (Chat, Camera, Gallery, Calls) using Lucide icons, highlighting the active tab with warm-accent color and scaling the active icon slightly.",
  "frontend/src/components/EmptyStateCalls.tsx": "Empty state UI component for the Calls tab, displaying an illustration and romantic prompt text when no call history exists.",
  "frontend/src/components/EmptyStateChat.tsx": "Empty state UI component for the Chat page, showing an illustration and encouraging message when no messages have been sent yet.",
  "frontend/src/components/EmptyStateGallery.tsx": "Empty state UI component for the Gallery page, displaying an illustration and prompt text when no shared photos exist.",
  "frontend/src/components/ErrorToast.tsx": "Animated slide-in toast component for displaying error messages, auto-dismissing after 5 seconds with a manual close button and smooth CSS transition.",
  "frontend/src/components/IncomingCallOverlay.tsx": "Renders an overlay UI for incoming voice calls, handling accept (WebRTC peer connection setup, ICE candidates, SDP answer) and decline actions using React hooks and ICP backend mutations.",
  "frontend/src/components/LoadingSpinner.tsx": "A reusable animated loading spinner component using Lucide's Loader2 icon, supporting optional full-screen mode and custom size/className props.",
  "frontend/src/components/PhotoModal.tsx": "A modal component for displaying photos with support for pinch-to-zoom, mouse wheel zoom, drag-to-pan, and keyboard (Escape) dismissal.",
  "frontend/src/components/SkeletonCallCard.tsx": "A skeleton placeholder component mimicking a call card's layout (avatar, name, timestamp) for use during loading states.",
  "frontend/src/components/SkeletonGridCell.tsx": "A skeleton placeholder for a square grid cell, used as a loading state for photo grid items.",
  "frontend/src/components/SkeletonMessageBubble.tsx": "A skeleton placeholder for a chat message bubble, supporting left or right alignment to mimic sent/received messages during loading.",
  "frontend/src/components/SplashScreen.tsx": "An animated splash screen component that fades in/out with the app logo, tagline, and pulsing dots, displayed during initial app load.",
  "frontend/src/components/VideoIncomingCallOverlay.tsx": "Renders an overlay UI for incoming video calls, handling accept (requesting camera/mic, WebRTC setup) and decline actions, with camera permission denial feedback.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useErrorToast.ts": "Provides a global error toast system with a provider hook to manage toast state and a standalone showError function callable outside React components.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via a React context provider and hook, managing AuthClient creation, login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profile management, pairing, messaging, media uploads, and call session operations using @tanstack/react-query.",
  "frontend/src/index.css": "Global stylesheet that sets up a romantic blush/rose design system using Tailwind CSS with custom OKLCH color tokens, typography, animations (shimmer, pulse), and scrollbar styling.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ActiveCallPage.tsx": "Voice call page component that manages a WebRTC peer connection with microphone access, ICE candidate exchange, mute/speaker controls, and call duration timer.",
  "frontend/src/pages/ActiveVideoCallPage.tsx": "Video call page component that handles WebRTC audio/video streaming with mute, camera toggle, front/back camera switching, and a draggable picture-in-picture local video overlay.",
  "frontend/src/pages/CallsPage.tsx": "Calls page that displays call history with status icons and allows initiating voice or video calls to a paired partner via call session mutations.",
  "frontend/src/pages/CameraPage.tsx": "Camera page that captures photos using a custom useCamera hook, compresses them, previews them, and uploads them as media blobs to the backend.",
  "frontend/src/pages/ChatPage.tsx": "Chat page component that displays paginated messages between paired users, supports sending messages via Enter key, polls for new messages, and marks messages as read on view.",
  "frontend/src/pages/GalleryPage.tsx": "Gallery page that displays paginated shared media items in a grid, supports viewing photos in a modal, and allows deleting media with confirmation.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with a background image, app branding, and an Internet Identity login button for the OnlyUs couples app.",
  "frontend/src/pages/OutgoingCallPage.tsx": "Outgoing WebRTC audio call page that creates an offer, sends ICE candidates, watches for the partner's answer, and handles call cancellation or failure.",
  "frontend/src/pages/PairingPage.tsx": "Pairing page where a user can share their generated couple code or enter a partner's 6-digit code to link two accounts together.",
  "frontend/src/pages/RegistrationPage.tsx": "Registration page that prompts a newly authenticated user to choose a username, then calls the registerUser mutation to create their profile.",
  "frontend/src/pages/VideoOutgoingCallPage.tsx": "React page component for initiating an outgoing WebRTC video call, handling media capture, peer connection setup, SDP offer creation, and ICE candidate exchange via polling hooks.",
  "frontend/src/utils/compressImage.ts": "Utility that compresses an image File/Blob to a max 1280px dimension at JPEG quality 0.82 using a canvas, returning the result as a Uint8Array with size metadata. Also exports a file size formatter helper.",
  "frontend/src/utils/formatTimestamp.ts": "Converts a Motoko nanosecond epoch timestamp string into a human-readable 'Today', 'Yesterday', or date string with time.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a romantic rose/blush color palette using OKLCH, custom fonts (Playfair Display, Inter), border radii, box shadows, and shimmer/accordion animations.",
  "project_state.json": "Project state document describing the 'OnlyUs' couples app architecture, feature phases (chat, camera/gallery, voice/video calls, polish), known issues, and image asset requirements for a React/Motoko ICP stack."
}